ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_OUTPUTXBAR_CONTROLSS_502D8000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_OUTPUTXBAR_STATUS" acronym="CONTROLSS_OUTPUTXBAR_STATUS" offset="16" width="32" description="Output Signal Status.">
		<bitfield id="OUTPUTXBAR_STATUS_STS" width="16" begin="15" end="0" resetval="0x0" description="Status" range="15:0" rwaccess="R"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_FLAGINVERT" acronym="CONTROLSS_OUTPUTXBAR_FLAGINVERT" offset="20" width="32" description="Output Signal Invert Before Latch.">
		<bitfield id="OUTPUTXBAR_FLAGINVERT_INVERT" width="16" begin="15" end="0" resetval="0x0" description="FlagInvert" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_FLAG" acronym="CONTROLSS_OUTPUTXBAR_FLAG" offset="24" width="32" description="Output Signal Latched Flag.">
		<bitfield id="OUTPUTXBAR_FLAG_BIT15" width="1" begin="15" end="15" resetval="0x0" description="Output XBAR flag" range="15" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT14" width="1" begin="14" end="14" resetval="0x0" description="Output XBAR flag" range="14" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT13" width="1" begin="13" end="13" resetval="0x0" description="Output XBAR flag" range="13" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT12" width="1" begin="12" end="12" resetval="0x0" description="Output XBAR flag" range="12" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT11" width="1" begin="11" end="11" resetval="0x0" description="Output XBAR flag" range="11" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT10" width="1" begin="10" end="10" resetval="0x0" description="Output XBAR flag" range="10" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT9" width="1" begin="9" end="9" resetval="0x0" description="Output XBAR flag" range="9" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT8" width="1" begin="8" end="8" resetval="0x0" description="Output XBAR flag" range="8" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT7" width="1" begin="7" end="7" resetval="0x0" description="Output XBAR flag" range="7" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT6" width="1" begin="6" end="6" resetval="0x0" description="Output XBAR flag" range="6" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT5" width="1" begin="5" end="5" resetval="0x0" description="Output XBAR flag" range="5" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT4" width="1" begin="4" end="4" resetval="0x0" description="Output XBAR flag" range="4" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT3" width="1" begin="3" end="3" resetval="0x0" description="Output XBAR flag" range="3" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT2" width="1" begin="2" end="2" resetval="0x0" description="Output XBAR flag" range="2" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT1" width="1" begin="1" end="1" resetval="0x0" description="Output XBAR flag" range="1" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_BIT0" width="1" begin="0" end="0" resetval="0x0" description="Output XBAR flag" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_FLAG_CLR" acronym="CONTROLSS_OUTPUTXBAR_FLAG_CLR" offset="28" width="32" description="Output Signal Latched Flag Clear.">
		<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT15" width="1" begin="15" end="15" resetval="0x0" description="Output XBAR flag clear" range="15" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT14" width="1" begin="14" end="14" resetval="0x0" description="Output XBAR flag clear" range="14" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT13" width="1" begin="13" end="13" resetval="0x0" description="Output XBAR flag clear" range="13" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT12" width="1" begin="12" end="12" resetval="0x0" description="Output XBAR flag clear" range="12" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT11" width="1" begin="11" end="11" resetval="0x0" description="Output XBAR flag clear" range="11" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT10" width="1" begin="10" end="10" resetval="0x0" description="Output XBAR flag clear" range="10" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT9" width="1" begin="9" end="9" resetval="0x0" description="Output XBAR flag clear" range="9" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT8" width="1" begin="8" end="8" resetval="0x0" description="Output XBAR flag clear" range="8" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT7" width="1" begin="7" end="7" resetval="0x0" description="Output XBAR flag clear" range="7" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT6" width="1" begin="6" end="6" resetval="0x0" description="Output XBAR flag clear" range="6" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT5" width="1" begin="5" end="5" resetval="0x0" description="Output XBAR flag clear" range="5" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT4" width="1" begin="4" end="4" resetval="0x0" description="Output XBAR flag clear" range="4" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT3" width="1" begin="3" end="3" resetval="0x0" description="Output XBAR flag clear" range="3" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT2" width="1" begin="2" end="2" resetval="0x0" description="Output XBAR flag clear" range="2" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT1" width="1" begin="1" end="1" resetval="0x0" description="Output XBAR flag clear" range="1" rwaccess="R/W"/>
	<bitfield id="OUTPUTXBAR_FLAG_CLR_BIT0" width="1" begin="0" end="0" resetval="0x0" description="Output XBAR flag clear" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_FLAGFORCE" acronym="CONTROLSS_OUTPUTXBAR_FLAGFORCE" offset="32" width="32" description="Output Signal Latched Flag Force.">
		<bitfield id="OUTPUTXBAR_FLAGFORCE_FRC" width="16" begin="15" end="0" resetval="0x0" description="FlagForce" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_OUTLATCH" acronym="CONTROLSS_OUTPUTXBAR_OUTLATCH" offset="36" width="32" description="Output Signal Select Latch.">
		<bitfield id="OUTPUTXBAR_OUTLATCH_LATCHSEL" width="16" begin="15" end="0" resetval="0x0" description="OutLatch" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_OUTSTRETCH" acronym="CONTROLSS_OUTPUTXBAR_OUTSTRETCH" offset="40" width="32" description="Output Signal Stretched Pulse Version Select.">
		<bitfield id="OUTPUTXBAR_OUTSTRETCH_STRETCHSEL" width="16" begin="15" end="0" resetval="0x0" description="OutStretch" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_OUTLENGTH" acronym="CONTROLSS_OUTPUTXBAR_OUTLENGTH" offset="44" width="32" description="Output Signal Stretched Pulse Length Select.">
		<bitfield id="OUTPUTXBAR_OUTLENGTH_LENGTHSEL" width="16" begin="15" end="0" resetval="0x0" description="OutLength" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR_OUTINVERT" acronym="CONTROLSS_OUTPUTXBAR_OUTINVERT" offset="48" width="32" description="Output Signal Invert Select.">
		<bitfield id="OUTPUTXBAR_OUTINVERT_OUTINVERT" width="16" begin="15" end="0" resetval="0x0" description="OutInvert" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G0" acronym="CONTROLSS_OUTPUTXBAR0_G0" offset="256" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR0 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G1" acronym="CONTROLSS_OUTPUTXBAR0_G1" offset="260" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR0 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G2" acronym="CONTROLSS_OUTPUTXBAR0_G2" offset="264" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR0 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G3" acronym="CONTROLSS_OUTPUTXBAR0_G3" offset="268" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR0 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G4" acronym="CONTROLSS_OUTPUTXBAR0_G4" offset="272" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR0 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G5" acronym="CONTROLSS_OUTPUTXBAR0_G5" offset="276" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR0 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G6" acronym="CONTROLSS_OUTPUTXBAR0_G6" offset="280" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR0 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G7" acronym="CONTROLSS_OUTPUTXBAR0_G7" offset="284" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR0 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G8" acronym="CONTROLSS_OUTPUTXBAR0_G8" offset="288" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR0 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G9" acronym="CONTROLSS_OUTPUTXBAR0_G9" offset="292" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBAR0 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR0_G10" acronym="CONTROLSS_OUTPUTXBAR0_G10" offset="296" width="32" description="OUTPUT XBAR 0 Input Select.">
		<bitfield id="OUTPUTXBAR0_G10_SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBAR0 G10 Input Select30:FSIRX0.RX_TRIG074:FSIRX1.RX_TRIG0118:FSIRX2.RX_TRIG01512:FSIRX3.RX_TRIG0" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G0" acronym="CONTROLSS_OUTPUTXBAR1_G0" offset="320" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR1 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G1" acronym="CONTROLSS_OUTPUTXBAR1_G1" offset="324" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR1 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G2" acronym="CONTROLSS_OUTPUTXBAR1_G2" offset="328" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR1 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G3" acronym="CONTROLSS_OUTPUTXBAR1_G3" offset="332" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR1 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G4" acronym="CONTROLSS_OUTPUTXBAR1_G4" offset="336" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR1 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G5" acronym="CONTROLSS_OUTPUTXBAR1_G5" offset="340" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR1 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G6" acronym="CONTROLSS_OUTPUTXBAR1_G6" offset="344" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR1 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G7" acronym="CONTROLSS_OUTPUTXBAR1_G7" offset="348" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR1 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G8" acronym="CONTROLSS_OUTPUTXBAR1_G8" offset="352" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR1 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G9" acronym="CONTROLSS_OUTPUTXBAR1_G9" offset="356" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBAR1 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR1_G10" acronym="CONTROLSS_OUTPUTXBAR1_G10" offset="360" width="32" description="OUTPUT XBAR 1 Input Select.">
		<bitfield id="OUTPUTXBAR1_G10_SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBAR1 G10 Input Select30:FSIRX0.RX_TRIG074:FSIRX1.RX_TRIG0118:FSIRX2.RX_TRIG01512:FSIRX3.RX_TRIG0" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G0" acronym="CONTROLSS_OUTPUTXBAR2_G0" offset="384" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR2 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G1" acronym="CONTROLSS_OUTPUTXBAR2_G1" offset="388" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR2 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G2" acronym="CONTROLSS_OUTPUTXBAR2_G2" offset="392" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR2 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G3" acronym="CONTROLSS_OUTPUTXBAR2_G3" offset="396" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR2 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G4" acronym="CONTROLSS_OUTPUTXBAR2_G4" offset="400" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR2 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G5" acronym="CONTROLSS_OUTPUTXBAR2_G5" offset="404" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR2 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G6" acronym="CONTROLSS_OUTPUTXBAR2_G6" offset="408" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR2 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G7" acronym="CONTROLSS_OUTPUTXBAR2_G7" offset="412" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR2 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G8" acronym="CONTROLSS_OUTPUTXBAR2_G8" offset="416" width="32" description="OUTPUT XBAR 2 Input Select.">
		<bitfield id="OUTPUTXBAR2_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR2 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR2_G9" acronym="CONTROLSS_OUTPUTXBAR2_G9" offset="420" width="32" description="OUTPUT XBAR 2 Input Select.">
