ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_OUTPUTXBAR_CONTROLSS_502D8000h.xml
		<bitfield id="OUTPUTXBAR7_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR7 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G1" acronym="CONTROLSS_OUTPUTXBAR7_G1" offset="708" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR7 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G2" acronym="CONTROLSS_OUTPUTXBAR7_G2" offset="712" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR7 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G3" acronym="CONTROLSS_OUTPUTXBAR7_G3" offset="716" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR7 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G4" acronym="CONTROLSS_OUTPUTXBAR7_G4" offset="720" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR7 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G5" acronym="CONTROLSS_OUTPUTXBAR7_G5" offset="724" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR7 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G6" acronym="CONTROLSS_OUTPUTXBAR7_G6" offset="728" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR7 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G7" acronym="CONTROLSS_OUTPUTXBAR7_G7" offset="732" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR7 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G8" acronym="CONTROLSS_OUTPUTXBAR7_G8" offset="736" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR7 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G9" acronym="CONTROLSS_OUTPUTXBAR7_G9" offset="740" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBAR7 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR7_G10" acronym="CONTROLSS_OUTPUTXBAR7_G10" offset="744" width="32" description="OUTPUT XBAR 7 Input Select.">
		<bitfield id="OUTPUTXBAR7_G10_SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBAR7 G10 Input Select30:FSIRX0.RX_TRIG074:FSIRX1.RX_TRIG0118:FSIRX2.RX_TRIG01512:FSIRX3.RX_TRIG0" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G0" acronym="CONTROLSS_OUTPUTXBAR8_G0" offset="768" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR8 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G1" acronym="CONTROLSS_OUTPUTXBAR8_G1" offset="772" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR8 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G2" acronym="CONTROLSS_OUTPUTXBAR8_G2" offset="776" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR8 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G3" acronym="CONTROLSS_OUTPUTXBAR8_G3" offset="780" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR8 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G4" acronym="CONTROLSS_OUTPUTXBAR8_G4" offset="784" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR8 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G5" acronym="CONTROLSS_OUTPUTXBAR8_G5" offset="788" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR8 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G6" acronym="CONTROLSS_OUTPUTXBAR8_G6" offset="792" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR8 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G7" acronym="CONTROLSS_OUTPUTXBAR8_G7" offset="796" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR8 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G8" acronym="CONTROLSS_OUTPUTXBAR8_G8" offset="800" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR8 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G9" acronym="CONTROLSS_OUTPUTXBAR8_G9" offset="804" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBAR8 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR8_G10" acronym="CONTROLSS_OUTPUTXBAR8_G10" offset="808" width="32" description="OUTPUT XBAR 8 Input Select.">
		<bitfield id="OUTPUTXBAR8_G10_SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBAR8 G10 Input Select30:FSIRX0.RX_TRIG074:FSIRX1.RX_TRIG0118:FSIRX2.RX_TRIG01512:FSIRX3.RX_TRIG0" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G0" acronym="CONTROLSS_OUTPUTXBAR9_G0" offset="832" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR9 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G1" acronym="CONTROLSS_OUTPUTXBAR9_G1" offset="836" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR9 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G2" acronym="CONTROLSS_OUTPUTXBAR9_G2" offset="840" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR9 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G3" acronym="CONTROLSS_OUTPUTXBAR9_G3" offset="844" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR9 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G4" acronym="CONTROLSS_OUTPUTXBAR9_G4" offset="848" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR9 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G5" acronym="CONTROLSS_OUTPUTXBAR9_G5" offset="852" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR9 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G6" acronym="CONTROLSS_OUTPUTXBAR9_G6" offset="856" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR9 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G7" acronym="CONTROLSS_OUTPUTXBAR9_G7" offset="860" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR9 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G8" acronym="CONTROLSS_OUTPUTXBAR9_G8" offset="864" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR9 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G9" acronym="CONTROLSS_OUTPUTXBAR9_G9" offset="868" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBAR9 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR9_G10" acronym="CONTROLSS_OUTPUTXBAR9_G10" offset="872" width="32" description="OUTPUT XBAR 9 Input Select.">
		<bitfield id="OUTPUTXBAR9_G10_SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBAR9 G10 Input Select30:FSIRX0.RX_TRIG074:FSIRX1.RX_TRIG0118:FSIRX2.RX_TRIG01512:FSIRX3.RX_TRIG0" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G0" acronym="CONTROLSS_OUTPUTXBAR10_G0" offset="896" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR10 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G1" acronym="CONTROLSS_OUTPUTXBAR10_G1" offset="900" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR10 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G2" acronym="CONTROLSS_OUTPUTXBAR10_G2" offset="904" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G2_SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBAR10 G2 input bit select. Input source is PWM[x].SOCB1:PWM[x] SOCB selected0:PWM[x] SOCB is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G3" acronym="CONTROLSS_OUTPUTXBAR10_G3" offset="908" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G3_SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBAR10 G3 input bit select. Input source is DEL[x].ACTIVE1:DEL[x] ACTIVE selected0:DEL[x] ACTIVE is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G4" acronym="CONTROLSS_OUTPUTXBAR10_G4" offset="912" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBAR10 G4 input bit select. Input source is DEL[x].TRIP1:DEL[x] TRIP selected0:DEL[x] TRIP is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G5" acronym="CONTROLSS_OUTPUTXBAR10_G5" offset="916" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G5_SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBAR10 G5 input bit select.0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G6" acronym="CONTROLSS_OUTPUTXBAR10_G6" offset="920" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G6_SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBAR10 G6 Input Select0:CMP12SS0.CTRIPOUTL1:CMP12SS0.CTRIPOUTH2:CMP12SS1.CTRIPOUTL3:CMP12SS1.CTRIPOUTH4:CMP12SS2.CTRIPOUTL5:CMP12SS2.CTRIPOUTH6:CMP12SS3.CTRIPOUTL7:CMP12SS3.CTRIPOUTH8:CMP12SS4.CTRIPOUTL9:CMP12SS4.CTRIPOUTH10:CMP12SS5.CTRIPOUTL11:CMP12SS5.CTRIPOUTH12:CMP12SS6.CTRIPOUTL13:CMP12SS6.CTRIPOUTH14:CMP12SS7.CTRIPOUTL15:CMP12SS7.CTRIPOUTH16:CMP12SS8.CTRIPOUTL17:CMP12SS8.CTRIPOUTH18:CMP12SS9.CTRIPOUTL19:CMP12SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G7" acronym="CONTROLSS_OUTPUTXBAR10_G7" offset="924" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G7_SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBAR10 G7 Input Select0:CMP8SS0.CTRIPOUTL1:CMP8SS0.CTRIPOUTH2:CMP8SS1.CTRIPOUTL3:CMP8SS1.CTRIPOUTH4:CMP8SS2.CTRIPOUTL5:CMP8SS2.CTRIPOUTH6:CMP8SS3.CTRIPOUTL7:CMP8SS3.CTRIPOUTH8:CMP8SS4.CTRIPOUTL9:CMP8SS4.CTRIPOUTH10:CMP8SS5.CTRIPOUTL11:CMP8SS5.CTRIPOUTH12:CMP8SS6.CTRIPOUTL13:CMP8SS6.CTRIPOUTH14:CMP8SS7.CTRIPOUTL15:CMP8SS7.CTRIPOUTH16:CMP8SS8.CTRIPOUTL17:CMP8SS8.CTRIPOUTH18:CMP8SS9.CTRIPOUTL19:CMP8SS9.CTRIPOUTH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G8" acronym="CONTROLSS_OUTPUTXBAR10_G8" offset="928" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G8_SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBAR10 G8 Input Select0:ADC0.EVT11:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1 EVT48:ADC2.EVT19:ADC2 EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G9" acronym="CONTROLSS_OUTPUTXBAR10_G9" offset="932" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G9_SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBAR10 G9 Input Select0:PWMSyncOutXBAR.SYNCOUT01:PWMSyncOutXBAR.SYNCOUT12:PWMSyncOutXBAR.SYNCOUT23:PWMSyncOutXBAR.SYNCOUT34:EQEP0.I_OUT5:EQEP0.S_OUT6:EQEP1.I_OUT7:EQEP1.S_OUT8:EQEP2.I_OUT9:EQEP2.S_OUT10:ECAP0.OUT11:ECAP1.OUT12:ECAP2.OUT13:ECAP3.OUT14:ECAP4.OUT15:ECAP5.OUT16:ECAP6.OUT17:ECAP7.OUT18:ECAP8.OUT19:ECAP9.OUT" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR10_G10" acronym="CONTROLSS_OUTPUTXBAR10_G10" offset="936" width="32" description="OUTPUT XBAR 10 Input Select.">
		<bitfield id="OUTPUTXBAR10_G10_SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBAR10 G10 Input Select30:FSIRX0.RX_TRIG074:FSIRX1.RX_TRIG0118:FSIRX2.RX_TRIG01512:FSIRX3.RX_TRIG0" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G0" acronym="CONTROLSS_OUTPUTXBAR11_G0" offset="960" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBAR11 G0 input bit select. Input source is PWM[x].TRIPOUT1:PWM[x] TRIPOUT selected0:PWM[x] TRIPOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G1" acronym="CONTROLSS_OUTPUTXBAR11_G1" offset="964" width="32" description="OUTPUT XBAR 11 Input Select.">
		<bitfield id="OUTPUTXBAR11_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBAR11 G1 input bit select. Input source is PWM[x].SOCA1:PWM[x] SOCA selected0:PWM[x] SOCA is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_OUTPUTXBAR11_G2" acronym="CONTROLSS_OUTPUTXBAR11_G2" offset="968" width="32" description="OUTPUT XBAR 11 Input Select.">
